#+BEGIN_SRC jupyter-python :session py
from sklearn.ensemble import RandomForestRegressor
from sklearn.metrics import mean_absolute_error
#+END_SRC

#+RESULTS:

#+BEGIN_SRC jupyter-python :session py
import pandas as pd
from sklearn.model_selection import train_test_split

melbourne_file_path = '../../data/input/melb_data.csv'
melbourne_data = pd.read_csv(melbourne_file_path)
filtered_melbourne_data = melbourne_data.dropna(axis=0)

y = filtered_melbourne_data.Price
melbourne_features = ['Rooms', 'Bathroom', 'Landsize', 'BuildingArea', 'YearBuilt', 'Lattitude', 'Longtitude']
X = filtered_melbourne_data[melbourne_features]
train_X, val_X, train_y, val_y = train_test_split(X, y, random_state=0)

forest_model = RandomForestRegressor(random_state=1)
forest_model.fit(train_X, train_y)
melb_preds = forest_model.predict(val_X)
print(mean_absolute_error(val_y, melb_preds))
#+END_SRC

#+RESULTS:
: 191669.7536453626
